#Задача 4
#Петя, Катя и Сережа делают из бумаги журавликов. Вместе
#они сделали S журавликов. Сколько журавликов сделал каждый
#ребенок, если известно, что Петя и Сережа сделали одинаковое
#количество журавликов, а Катя сделала в два раза больше журавликов,
#чем Петя и Сережа вместе?
n = 6
x = n // 6
petia = x
katia = 4 * x
sergei = x

# Вывод результата
print(petia, katia, sergei)

